Revit 2017 API
RenderingSettings.PrinterResolution Property
 The resolution level when using printer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public PrinterResolution PrinterResolution { get; set; }
Visual Basic
Public Property PrinterResolution As PrinterResolution
	Get
	Set
Visual C++
public:
property PrinterResolution PrinterResolution {
	PrinterResolution get ();
	void set (PrinterResolution value);
}
Remarks
 The suitable resolution value is decided by default. You may obtain it from the ResolutionValue property.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The enum value is not valid for PrinterResolution. -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  The resolution target is not printer.
See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace